<a href="https://colab.research.google.com/github/Raziel-JKM/Python/blob/python/%EB%8D%B0%EC%9D%B4%ED%84%B0_%EB%B6%84%EC%84%9D%EC%9D%84_%EC%9C%84%ED%95%9C_%EB%9D%BC%EC%9D%B4%EB%B8%8C%EB%9F%AC%EB%A6%AC04_Pandas_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

데이터 프레임 정렬하기

In [ ]:
df = df.sort_indax(axis = 0) #인덱스 값을 기준으로 정렬

In [ ]:
df = df.sort_indax(axis = 1, ascending = False) #False - 내림차순으로 정렬

In [ ]:
df.sort_values('col1', ascending = True ) #컬럼 기준으로 오름차순 #_values임을 주의

In [ ]:
df.sort_values('col1', ascending = False ) # 컬럼 기준으로 내림차순

In [ ]:
df.sort_values('col1','col2', ascending = [True, False]) # col1,col2순으로 정렬하고 / col1은 오름차순, col2는 내림차순으로 정렬 / 각각따로 적용가능

[실습1] 데이터프레임 정렬하기

In [3]:
import numpy as np
import pandas as pd

print("DataFrame: ")
df = pd.DataFrame({
    'col1' : [2, 1, 9, 8, 7, 4],
    'col2' : ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col3': [0, 1, 9, 4, 2, 3],
})
print(df, "\n")

DataFrame:
   col1 col2  col3
0     2    A     0
1     1    A     1
2     9    B     9
3     8  NaN     4
4     7    D     2
5     4    C     3



# 정렬 코드 입력해보기    
# 1. col1을 기준으로 오름차순으로 정렬하기.

# 2. col2를 기준으로 내림차순으로 정렬하기.

# 3. col2를 기준으로 오름차순으로, col1를 기준으로 내림차순으로 정렬하기.

In [8]:
sorted_df1 = df.sort_values('col1',ascending=True)
print(sorted_df1)

   col1 col2  col3
1     1    A     1
0     2    A     0
5     4    C     3
4     7    D     2
3     8  NaN     4
2     9    B     9

In [9]:
sorted_df2 = df.sort_values('col2',ascending=False)
print(sorted_df2)

   col1 col2  col3
4     7    D     2
5     4    C     3
2     9    B     9
0     2    A     0
1     1    A     1
3     8  NaN     4

In [11]:
sorted_df3 = df.sort_values(['col2','col2'],ascending=[ True,False])
print(sorted_df3)

   col1 col2  col3
0     2    A     0
1     1    A     1
2     9    B     9
5     4    C     3
4     7    D     2
3     8  NaN     4



---
데이터프레임 분석용 함수

집계함수 count, max min sum

In [12]:
data = {
    'korea':[50,60,70],
    'math':[10,np.nan, 40]
}

df= pd.DataFrame(data, index = ['a','b','c'])
df.count(axis = 0) #열 기준
df.count(axis = 1) #행 기준

a    2
b    1
c    2
dtype: int64

In [13]:
df.max() # 최댓값
df.min() # 최솟값

korea    50.0
math     10.0
dtype: float64

In [14]:
df.sum() # 합계
df.mean() # 평균

korea    60.0
math     25.0
dtype: float64

In [19]:
df.sum(axis=1)
df.mean(axis=1 , skipna= True) #(60+nan)/2 = nan -> skipna는 nan값 무시

a    30.0
b    60.0
c    55.0
dtype: float64

NaN값이 존재하는 column의 평균 구하여 Nan값 대체

In [21]:
B_avg = df['math'].mean()
print(B_avg)

25.0

In [31]:
df['math'] = df['math'].fillna(B_avg) #df의 math 컬럼의 NaN값 대체
print(B_avg)

a    10.0
b    25.0
c    40.0
Name: math, dtype: float64

In [32]:
# 대체 후 평균
df.mean(axis=1, skipna=False)

a    30.0
b    42.5
c    55.0
dtype: float64

실습]집계함수

In [39]:
import numpy as np
import pandas as pd

data = {
    'korean' : [50, 60, 70],
    'math' : [10, np.nan, 40]
}
df = pd.DataFrame(data, index = ['a','b','c'])
print(df, "\n")

# 각 컬럼별 데이터 개수
col_num = df.count(axis=0) #컬럼별이니 axis=0 필요
print(col_num, "\n")

# 각 행별 데이터 개수
row_num = df.count(axis=1)
print(row_num, "\n")

# 각 컬럼별 최댓값
col_max = df.max()
print(col_max, "\n")

# 각 컬럼별 최솟값
col_min = df.min()
print(col_min, "\n")

# 각 컬럼별 합계
col_sum = df.sum()
print(col_sum, "\n")

# 컬럼의 최솟값으로 NaN값 대체
math_min = df['math'].min()
df['math'] = df['math'].fillna(math_min)
print(df, "\n")

# 각 컬럼별 평균
col_avg = df.mean()
print(col_avg, "\n")

   korean  math
a      50  10.0
b      60   NaN
c      70  40.0

korean    3
math      2
dtype: int64

a    2
b    1
c    2
dtype: int64

korean    70.0
math      40.0
dtype: float64

korean    50.0
math      10.0
dtype: float64

korean    180.0
math       50.0
dtype: float64

   korean  math
a      50  10.0
b      60  10.0
c      70  40.0

korean    60.0
math      20.0
dtype: float64

03 그룹으로 묶기 group by

In [42]:
df = pd.DataFrame({
    'data1': range(6),
    'data2': [4,4,6,0,6,1],
    'key':['A','B','C','A','B','C']
    })
df

   data1  data2 key
0      0      4   A
1      1      4   B
2      2      6   C
3      3      0   A
4      4      6   B
5      5      1   C

In [44]:
df.groupby('key').sum()#1번

     data1  data2
key
A        3      4
B        5     10
C        7      7

In [45]:
df.groupby(['key','data1']).sum()

           data2
key data1
A   0          4
    3          0
B   1          4
    4          6
C   2          6
    5          1

In [48]:
df

   data1  data2 key
0      0      4   A
1      1      4   B
2      2      6   C
3      3      0   A
4      4      6   B
5      5      1   C

In [47]:
#groupby를 통해서 집계를 한번에 계산하는 방법
df.groupby('key').aggregate(['min', np.median, max])  #먼저 key 로 그룹바이 후,  data1,data2 각각 3개 적용

    data1            data2
      min median max   min median max
key
A       0    1.5   3     0    2.0   4
B       1    2.5   4     4    5.0   6
C       2    3.5   5     1    3.5   6

In [50]:
df.groupby('key').aggregate({'data1': 'min', 'data2': np.sum}) # 주의하기 ##먼저 key 로 그룹바이 후,

     data1  data2
key
A        0      4
B        1     10
C        2      7

In [53]:
#groupby를 통해서 그룹 속성을 기준으로 데이터 필터링
def filter_by_mean(x):
    return x['data2'].mean()>3

In [54]:
df.groupby('key').mean()

     data1  data2
key
A      1.5    2.0
B      2.5    5.0
C      3.5    3.5

In [55]:
df.groupby('key').filter(filter_by_mean)

   data1  data2 key
1      1      4   B
2      2      6   C
4      4      6   B
5      5      1   C

In [56]:
#groupby를 통해서 묶인 데이터에 함수 적용 # df 와 비교

df.groupby('key').apply(lambda x: x.max()- x.min())

     data1  data2
key
A        3      4
B        3      2
C        3      5

In [57]:
df

   data1  data2 key
0      0      4   A
1      1      4   B
2      2      6   C
3      3      0   A
4      4      6   B
5      5      1   C

In [ ]:
#groupby로 묶인 데이터에서 데이터 추출하기

df = pd.read_csv("./univ.csv")
#상위 5개 데이터

df.head() #데이터 추출

df.groupby("시도").get_group("충남")
len(df.groupby("시도").get_group("충남"))



---

[실습3] 그룹으로 묶기

In [59]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    'key': ['A', 'B', 'C', 'A', 'B', 'C'],
    'data1': [1, 2, 3, 1, 2, 3],
    'data2': [4, 4, 6, 0, 6, 1]
})
print("DataFrame:")
print(df, "\n")

DataFrame:
  key  data1  data2
0   A      1      4
1   B      2      4
2   C      3      6
3   A      1      0
4   B      2      6
5   C      3      1

# groupby 함수를 이용해봅시다.
# key를 기준으로 묶어 합계를 구해 출력해보세요.


# key와 data1을 기준으로 묶어 합계를 구해 출력해보세요.

In [63]:
print(df.groupby('key').sum())

     data1  data2
key
A        2      4
B        4     10
C        6      7

In [66]:
print(df.groupby(['key','data1']).sum()) #data1도 1에대해서 묶이니까 높이가 다르다 #주의

           data2
key data1
A   1          4
B   2         10
C   3          7



---

In [67]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    'key': ['A', 'B', 'C', 'A', 'B', 'C'],
    'data1': [0, 1, 2, 3, 4, 5],
    'data2': [4, 4, 6, 0, 6, 1]
})
print("DataFrame:")
print(df, "\n")

DataFrame:
  key  data1  data2
0   A      0      4
1   B      1      4
2   C      2      6
3   A      3      0
4   B      4      6
5   C      5      1

# aggregate를 이용하여 요약 통계량을 산출해봅시다.
# 데이터 프레임을 'key' 칼럼으로 묶고, data1과 data2 각각의 최솟값, 중앙값, 최댓값을 출력하세요.



# 데이터 프레임을 'key' 칼럼으로 묶고, data1의 최솟값, data2의 합계를 출력하세요.

In [70]:
print(df.groupby('key').aggregate([min, np.median, max]))

    data1            data2
      min median max   min median max
key
A       0    1.5   3     0    2.0   4
B       1    2.5   4     4    5.0   6
C       2    3.5   5     1    3.5   6

In [72]:
print(df.groupby('key').aggregate({'data1':min, 'data2':sum}))

     data1  data2
key
A        0      4
B        1     10
C        2      7